test/Ivory.Soap.UnitTests/Messages/HeaderWithComplexBody_v1.1.xml

<soap:Envelope encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header>
    <SimpleHeader>
      <Message>Wash your hands!</Message>
    </SimpleHeader>
  </soap:Header>
  <soap:Body>
    <complex:Complex p3:mood="Mellow" xmlns:p3="http://ivory.net/compex-mood" xmlns:complex="http://ivory.net/compex">
      <complex:Answer>42</complex:Answer>
    </complex:Complex>
  </soap:Body>
</soap:Envelope>
